src/InformationRegisters/КомандыПечатиЭтикеток/КомандыПечатиЭтикеток.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомандыПечатиЭтикеток</name>
  <attributes>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СразуНаПринтер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отключена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Выделить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <comment>имя макета</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоПриобретения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Местоположение</name>
    <type>
      <types>EnumRef.Местоположения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сайт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриблизительно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРазмещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыделитьЦветом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпьютернаяСборкаЕстьСвободные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпьютернаяСборкаКомпонент</name>
    <comment>это компонент компьютерной сборки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>QR_Code</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтикеткаРаспечатана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/ПечатьЭтикеток/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ЗаполнениеТабличногоДокумента

// Формирует табличный документ с этикетками указанных объектов печати.
// Размер этикетки 50х30 - 27,04 (гориз.) х 81,25 (верт.).
//
// Параметры:
//  п_ОбъектыПечати - Массив из СправочникСсылка.Номенклатура - объекты, для которых печатаются этикетки.
//  п_Макет - Строка - имя макета этикетки.
//
// Возвращаемое значение:
//  ТабличныйДокумент - табличный документ с этикетками.
//
Функция ПечатьЭтикетки50х30(п_ОбъектыПечати, п_Макет) Экспорт

	СортироватьМассив(п_ОбъектыПечати, НаправлениеСортировки.Возр, "Наименование");

	ТабДок = Новый ТабличныйДокумент;

	Макет = Справочники.Номенклатура.ПолучитьМакет(п_Макет);
	ОбЭтикетка = Макет.ПолучитьОбласть("Этикетка");

	Ном = 0;
	Для каждого п_ОбъектПечати Из п_ОбъектыПечати Цикл

		Если Ном > 0 Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		//@skip-check query-in-loop
		Выборка = ПолучитьВыборку(п_ОбъектПечати);

		Если Выборка.Следующий() Тогда

			ОбЭтикетка.Параметры.Код = Прав(Выборка.Код, 5);

			ПараметрыЗаполнения = Новый Структура();

			Если ЗначениеЗаполнено(Выборка.Дата) Тогда
				ПараметрыЗаполнения.Вставить("Дата", Формат(Выборка.Дата, "ДФ=dd.MM.yyyy"));
			КонецЕсли;

			Если ЗначениеЗаполнено(Выборка.НаименованиеДляПечати) Тогда
				ПараметрыЗаполнения.Вставить("Наименование", Выборка.НаименованиеДляПечати);
			Иначе
				ПараметрыЗаполнения.Вставить("Наименование", Выборка.Наименование);
			КонецЕсли;

			Если п_Макет = "Этикетка50х30_2" Тогда
				Если ЗначениеЗаполнено(Выборка.НаименованиеДляПечати) Тогда
					ВхСтрока = Выборка.НаименованиеДляПечати;
					Шаблон = "\(\d/\d\)";
					РезПоиска = СтрНайтиПоРегулярномуВыражению(ВхСтрока, Шаблон);
					Если РезПоиска.НачальнаяПозиция <> 0 Тогда
						Номер = Сред(ВхСтрока, РезПоиска.НачальнаяПозиция, РезПоиска.Длина);
						ПараметрыЗаполнения.Вставить("Номер", Номер);
						ПараметрыЗаполнения.Вставить("Наименование", СтрЗаменить(ВхСтрока, Номер, ""));
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли п_Макет = "ЭтикеткаИнвНомер50х30_QR" Тогда
				//@skip-check bsl-legacy-check-dynamic-feature-access
				ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(Выборка.QR_Code, 0, 190);
				Если ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
					КартинкаQRКода = Новый Картинка(ДанныеQRКода);
					ОбЭтикетка.Рисунки.QRКод.Картинка = КартинкаQRКода;
				КонецЕсли;
			КонецЕсли;

			ОбЭтикетка.Параметры.Заполнить(ПараметрыЗаполнения);

			ТабДок.Вывести(ОбЭтикетка);

			Ном = Ном + 1;
		КонецЕсли;

	КонецЦикла; // объекты печати

	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;

	ТабДок.РазмерКолонтитулаСверху = 0;
	ТабДок.РазмерКолонтитулаСнизу = 0;
	ТабДок.ПолеСверху = 0;
	ТабДок.ПолеСнизу = 0;
	ТабДок.ПолеСправа = 0;
	ТабДок.ПолеСлева = 0;

	Возврат ТабДок;

КонецФункции

// Сортирует массив по значению указанного свойства элементов.
//
// Параметры:
//  Массив - Массив из Произвольный - сортируемый массив.
//  Направление - НаправлениеСортировки - направление сортировки.
//  Свойство - Строка, Неопределено - имя свойства элемента для сравнения; Неопределено - сравнение самих элементов.
//
Процедура СортироватьМассив(Массив, Направление, Свойство = Неопределено) Экспорт

	СравнениеЗначений = Новый СравнениеЗначений;
	Для Индекс = 0 По Массив.ВГраница() Цикл
		Для ИндексЭлемента = 0 По Массив.ВГраница() - Индекс - 1 Цикл
			Если Свойство = Неопределено Тогда
				Значение1 = Массив[ИндексЭлемента];
				Значение2 = Массив[ИндексЭлемента + 1];
			Иначе
				Значение1 = Массив[ИндексЭлемента][Свойство];
				Значение2 = Массив[ИндексЭлемента + 1][Свойство];
			КонецЕсли;
			РезультатСравнения = СравнениеЗначений.Сравнить(Значение1, Значение2);
			Если РезультатСравнения > 0 И Направление = НаправлениеСортировки.Возр
				ИЛИ РезультатСравнения < 0 И Направление = НаправлениеСортировки.Убыв Тогда
				ТекущийЭлемент = Массив[ИндексЭлемента];
				Массив[ИндексЭлемента] = Массив[ИндексЭлемента + 1];
				Массив[ИндексЭлемента + 1] = ТекущийЭлемент;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область УправлениеКомандамиПечати

// Добавляет на форму команды печати этикеток, отобранные из регистра сведений.
//
// Параметры:
//  п_Форма - ФормаКлиентскогоПриложения - форма, на которую добавляются команды печати.
//
Процедура ВывестиКомандыПечати(п_Форма) Экспорт

	Элементы = п_Форма.Элементы;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КомандыПечатиЭтикеток.Идентификатор КАК Идентификатор,
		|	КомандыПечатиЭтикеток.Представление КАК Представление,
		|	КомандыПечатиЭтикеток.Порядок КАК Порядок,
		|	КомандыПечатиЭтикеток.СразуНаПринтер КАК СразуНаПринтер,
		|	КомандыПечатиЭтикеток.Отключена КАК Отключена,
		|	КомандыПечатиЭтикеток.Выделить КАК Выделить
		|ИЗ
		|	РегистрСведений.КомандыПечатиЭтикеток КАК КомандыПечатиЭтикеток
		|ГДЕ
		|	НЕ КомандыПечатиЭтикеток.Отключена
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл

		КомандаФормы = п_Форма.Команды.Добавить(Выборка.Идентификатор);

		КомандаФормы.Действие = "Подключаемый_Напечатать";
		КомандаФормы.Заголовок = Выборка.Представление;
		КомандаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст;
		Если Выборка.Выделить Тогда
			КомандаФормы.Картинка = БиблиотекаКартинок.Успешно;
		КонецЕсли;

		КнопкаФормы = Элементы.Добавить(КомандаФормы.Имя, Тип("КнопкаФормы"), Элементы.ПодменюПечать);
		КнопкаФормы.ИмяКоманды = КомандаФормы.Имя;

	КонецЦикла;

КонецПроцедуры

// Отмечает выбранную команду печати как выделенную, снимая отметку с остальных команд.
//
// Параметры:
//  п_Идентификатор - Строка - идентификатор выделяемой команды печати.
//
// Возвращаемое значение:
//  Булево - Истина, если выделение изменено; Ложь, если команда уже была выделена.
//
Функция ВыделитьКомандуПечати(п_Идентификатор) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КомандыПечатиЭтикеток.Выделить КАК Выделить
		|ИЗ
		|	РегистрСведений.КомандыПечатиЭтикеток КАК КомандыПечатиЭтикеток
		|ГДЕ
		|	КомандыПечатиЭтикеток.Идентификатор = &Идентификатор
		|	И КомандыПечатиЭтикеток.Выделить";

	Запрос.УстановитьПараметр("Идентификатор", п_Идентификатор);

	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;

	Выборка = РегистрыСведений.КомандыПечатиЭтикеток.Выбрать();
	Пока Выборка.Следующий() Цикл
		МЗ = РегистрыСведений.КомандыПечатиЭтикеток.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Выборка);
		Если Выборка.Идентификатор = п_Идентификатор Тогда
			МЗ.Выделить = Истина;
		Иначе
			МЗ.Выделить = Ложь;
		КонецЕсли;
		МЗ.Записать();
	КонецЦикла;

	Возврат Истина;

КонецФункции

// Устанавливает картинку выделения выбранной команде печати, остальным командам - пустую картинку.
//
// Параметры:
//  п_Форма - ФормаКлиентскогоПриложения - форма с командами печати.
//  п_Идентификатор - Строка - идентификатор команды, для которой устанавливается картинка.
//
Процедура УстановитьКартинкуКоманды(п_Форма, п_Идентификатор) Экспорт

	Элементы = п_Форма.Элементы;
	Для каждого Элемент Из Элементы.ПодменюПечать.ПодчиненныеЭлементы Цикл
		Если Элемент.Имя = п_Идентификатор Тогда
			Элемент.Картинка = БиблиотекаКартинок.Успешно;
		Иначе
			Элемент.Картинка = БиблиотекаКартинок.Пустая;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьВыборку(п_ОбъектПечати)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СправочникНоменклатура.Код КАК Код,
	|	СправочникНоменклатура.Наименование КАК Наименование,
	|	СправочникНоменклатура.QR_Code КАК QR_Code,
	|	СправочникНоменклатура.НаименованиеДляПечати КАК НаименованиеДляПечати,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК Дата
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	|		ПО СправочникНоменклатура.Ссылка = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И (ЦеныНоменклатурыСрезПоследних.ВидЦены.Наименование = ""Приобретение"")
	|ГДЕ
	|	СправочникНоменклатура.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", п_ОбъектПечати);

	Выборка = Запрос.Выполнить().Выбрать();

	Возврат Выборка;

КонецФункции

#КонецОбласти
